{
  "data": {
    "title": "July Goals",
    "date": "2015-07-03",
    "categories": [
      "goals"
    ],
    "tags": [
      "cleaning",
      "exercise",
      "goals-2",
      "project-life",
      "working-out"
    ],
    "coverImage": "https://www.everydayaccountsblog.com/wp-content/uploads/2015/07/BIRU-WP-20150703T094100GMT-0500.jpg",
    "id": "4514",
    "slug": "july-goals"
  },
  "content": {
    "type": "doc",
    "content": [
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "[caption id=\"attachment_4517\" align=\"alignnone\" width=\"1024\"]"
          },
          {
            "type": "image",
            "attrs": {
              "src": "images/BIRU-WP-20150703T094100GMT-0500-1024x1024.jpg",
              "alt": "7/3/15",
              "title": null
            },
            "marks": [
              {
                "type": "link",
                "attrs": {
                  "href": "http://www.everydayaccountsblog.com/wp-content/uploads/2015/07/BIRU-WP-20150703T094100GMT-0500.jpg",
                  "title": null
                }
              }
            ]
          },
          {
            "type": "text",
            "text": " Galveston, TX - July 2014[/caption]"
          }
        ]
      },
      {
        "type": "heading",
        "attrs": {
          "level": 2
        },
        "content": [
          {
            "type": "text",
            "text": "June Review"
          }
        ]
      },
      {
        "type": "heading",
        "attrs": {
          "level": 3
        },
        "content": [
          {
            "type": "text",
            "text": "Finish the "
          },
          {
            "type": "text",
            "marks": [
              {
                "type": "link",
                "attrs": {
                  "href": "https://www.creativelive.com/courses/make-your-dream-trip-reality-chris-guillebeau-stephanie-zito",
                  "title": null
                }
              }
            ],
            "text": "Make Your Dream Trip a Reality"
          },
          {
            "type": "text",
            "text": " online course."
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "Done! This course is great. It is so full of practical tips on how you can get SO MUCH free travel. It can definitely be a reality. We already have TONS of points and miles by using tips and tricks that this course teaches. I don't think that we will be paying for a flight for a long time."
          }
        ]
      },
      {
        "type": "heading",
        "attrs": {
          "level": 3
        },
        "content": [
          {
            "type": "text",
            "text": "Get back into a workout routine."
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "I went down to our apartment gym a few times this month, but I wouldn't call it a routine. I got so used to doing group classes at my gym in DC, so doing a solo workout on the elliptical each morning is just.... boring. See below in my July goals for what I'm going to try doing this month."
          }
        ]
      },
      {
        "type": "heading",
        "attrs": {
          "level": 3
        },
        "content": [
          {
            "type": "text",
            "text": "Get plugged back in to the blogging community."
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "I'm definitely getting there! I've gotten back into participating in The Peony Project on Facebook, reading and commenting regularly on other blogs, and learning how to improve my blog. I love this community!"
          }
        ]
      },
      {
        "type": "heading",
        "attrs": {
          "level": 3
        },
        "content": [
          {
            "type": "text",
            "text": "Get set up on my new Macbook Air."
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "I'm typing on the new laptop right now! I'm beginning to really love using a Mac. I use a PC at work, so it's a little tricky switching between the two, but I think I'm getting the hang of it. I haven't figured out a good photo editing system yet - I have all my iPhone pictures sync to my Dropbox account, so I'm trying to figure out a way to edit my photos directly in Dropbox without having to make a duplicate copy. It's harder than it sounds.... Does anyone else do this and have tips for me?"
          }
        ]
      },
      {
        "type": "heading",
        "attrs": {
          "level": 2
        },
        "content": [
          {
            "type": "text",
            "text": "July Goals"
          }
        ]
      },
      {
        "type": "heading",
        "attrs": {
          "level": 3
        },
        "content": [
          {
            "type": "text",
            "text": "Keep up with our purchases daily in our budgeting software."
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "I've been on again and off again with keeping up with a budget. We use the "
          },
          {
            "type": "text",
            "marks": [
              {
                "type": "link",
                "attrs": {
                  "href": "http://www.youneedabudget.com/",
                  "title": null
                }
              }
            ],
            "text": "YNAB"
          },
          {
            "type": "text",
            "text": " software which I really love, but it does require that you record and categorize each of your individual purchases (unlike Mint which automatically syncs with your accounts). Back in February when I first started using YNAB, I made it a weekly goal to record our purchases, but it would take way too long on Sunday evenings to get through them all. As daunting as it sounds, I think it will be much easier to spend five minutes at the end of each day recording our purchases for that day. I likely will miss some days, but catching up for a couple of days will take far less time than recording a full week."
          }
        ]
      },
      {
        "type": "heading",
        "attrs": {
          "level": 3
        },
        "content": [
          {
            "type": "text",
            "text": "Try a different approach to getting into a workout routine."
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "As mentioned above, I'm already bored with doing my morning workouts in our apartment gym. Just this morning, I started looking into doing the "
          },
          {
            "type": "text",
            "marks": [
              {
                "type": "link",
                "attrs": {
                  "href": "http://www.blogilates.com/blog/2014/12/30/new-beginners-calendar-2-0-for-2015/",
                  "title": null
                }
              }
            ],
            "text": "Blogilates Beginner's 2.0 Calendar"
          },
          {
            "type": "text",
            "text": ". It seems like just what I need right now - it has a calendar where I can check things off, all I need is a yoga mat, I can do it right in my own home, and there are plenty of other calendars that I can use in the future if I decide I like this format. Basically, I'm just looking for something to do while I wait for the new cycling and yoga studio to open up across the street from us later this fall. I think this is a great solution!"
          }
        ]
      },
      {
        "type": "heading",
        "attrs": {
          "level": 3
        },
        "content": [
          {
            "type": "text",
            "text": "Get through six more months of my 2014 Project Life album."
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "Last year around June, I completely set aside work on my Project Life album for nearly a year. Well, I'm back into it, and I'm determined to catch up and complete my 2014 album! I did two months in June, and I hope to finish out the year in July! It sounds ambitious, but since I started using the "
          },
          {
            "type": "text",
            "marks": [
              {
                "type": "link",
                "attrs": {
                  "href": "http://www.digitalprojectlife.com/",
                  "title": null
                }
              }
            ],
            "text": "digital version"
          },
          {
            "type": "text",
            "text": " on an app on my iPad, it's much quicker and just as a cute. Once I'm done, I hope to share my full album on the blog!"
          }
        ]
      },
      {
        "type": "heading",
        "attrs": {
          "level": 3
        },
        "content": [
          {
            "type": "text",
            "text": "Find a comfortable, waterproof jacket for our trip to Peru."
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "We leave July 31, and I currently don't own an outdoor jacket like this. Does anyone have any favorites? I know that some of them can get expensive, so I was hoping to get some ideas. I'm looking for something to keep warm (but not too warm!) since it's winter in Peru, and it needs to be waterproof and good for hiking."
          }
        ]
      },
      {
        "type": "heading",
        "attrs": {
          "level": 3
        },
        "content": [
          {
            "type": "text",
            "text": "Clean out my closet."
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "I just did this when we moved six months ago, but I already know I need to do it again. We don't have much closet space in our tiny one-bedroom apartment, and there are plenty of items in my closet that I have not worn once since the move."
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "It's going to be a good July! I hope that everyone has a great and relaxing holiday weekend!"
          }
        ]
      }
    ]
  }
}