{
  "data": {
    "title": "Scenes From the Month: December 2019",
    "date": "2020-01-06",
    "categories": [
      "scenes-from-the-month"
    ],
    "tags": [
      "christmas",
      "family",
      "travel"
    ],
    "coverImage": "https://www.everydayaccountsblog.com/wp-content/uploads/2020/01/SFTM_December-2019_5_EverydayAccountsBlog.com_.png",
    "id": "11201",
    "slug": "scenes-from-the-month-december-2019"
  },
  "content": {
    "type": "doc",
    "content": [
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "Welcome to my Scenes From the Month series, and Happy New Year!  In these posts, I share the highlights from my previous month ranging from the simple, everyday things to the more memorable events. One of the primary reasons that I blog is to keep a scrapbook that I can look back on in the future, and these posts help serve that purpose. Now that I have a little boy (with another on the way), everyday moments are extra special!"
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "Before we move on into 2020, I am sharing the highlights from our December. This month was crazy in terms of travel and plans, but it was really special too. For that reason, just like "
          },
          {
            "type": "text",
            "marks": [
              {
                "type": "link",
                "attrs": {
                  "href": "https://www.everydayaccountsblog.com/2019/12/scenes-from-the-month-november-2019/",
                  "title": null
                }
              }
            ],
            "text": "last month"
          },
          {
            "type": "text",
            "text": ", I'll probably have more photos than my usual "
          },
          {
            "type": "text",
            "marks": [
              {
                "type": "link",
                "attrs": {
                  "href": "https://www.everydayaccountsblog.com/category/scenes-from-the-month/",
                  "title": null
                }
              }
            ],
            "text": "Scenes from the Month"
          },
          {
            "type": "text",
            "text": " posts. The last quarter of the year is always so packed full of wonderful things!"
          }
        ]
      },
      {
        "type": "heading",
        "attrs": {
          "level": 2
        },
        "content": [
          {
            "type": "text",
            "text": "Favorites from the Month:"
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "Book - "
          },
          {
            "type": "text",
            "marks": [
              {
                "type": "em"
              },
              {
                "type": "link",
                "attrs": {
                  "href": "https://amzn.to/2tsr2IM",
                  "title": null
                }
              }
            ],
            "text": "Last Christmas in Paris"
          },
          {
            "type": "text",
            "marks": [
              {
                "type": "em"
              }
            ],
            "text": " (Amazon affiliate link)"
          },
          {
            "type": "text",
            "text": " by Hazel Gaynor and Heather Webb. This is a book of letters between two friends during World War I. The man is at war in France and the woman is home in England trying to figure out how to do her part in the war effort. I didn't expect to love it so much given its letter format, but it is done beautifully. It's romantic, well-written, and has a touch of Christmas."
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "Music - I discovered Ingrid Michaelson's "
          },
          {
            "type": "text",
            "marks": [
              {
                "type": "em"
              },
              {
                "type": "link",
                "attrs": {
                  "href": "https://amzn.to/35oUkWb",
                  "title": null
                }
              }
            ],
            "text": "Songs for the Season"
          },
          {
            "type": "text",
            "text": " album in the middle of the month, and I played it nonstop throughout New Year's."
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "Movie/TV - "
          },
          {
            "type": "text",
            "marks": [
              {
                "type": "em"
              }
            ],
            "text": "Little Women"
          },
          {
            "type": "text",
            "text": " in theaters with my sisters, sister's fiance Lane, Mom, and Daniel. This movie was so, so, so good. I see myself owning this one and re-watching, and I hardly ever re-watch anything."
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "Activity - Too many wonderful things to pick a favorite!"
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "Accomplishment - Getting TWO travel posts up on this blog this month (click "
          },
          {
            "type": "text",
            "marks": [
              {
                "type": "link",
                "attrs": {
                  "href": "https://www.everydayaccountsblog.com/2019/12/travel-with-me-baby-london-part-two/",
                  "title": null
                }
              }
            ],
            "text": "here"
          },
          {
            "type": "text",
            "text": " and "
          },
          {
            "type": "text",
            "marks": [
              {
                "type": "link",
                "attrs": {
                  "href": "https://www.everydayaccountsblog.com/2019/12/travel-with-me-baby-london-part-three/",
                  "title": null
                }
              }
            ],
            "text": "here"
          },
          {
            "type": "text",
            "text": "). Not sure how I had time for that in the middle of everything else, but somehow I did! Also, I'm pretty proud of us surviving our big Christmas trip with Carson - it was probably his final flight as a lap infant, since he turns two in just a few months."
          }
        ]
      },
      {
        "type": "heading",
        "attrs": {
          "level": 3
        },
        "content": [
          {
            "type": "text",
            "text": "Photos from the month, top left to bottom right:"
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "image",
            "attrs": {
              "src": "images/SFTM_December-2019_1_EverydayAccountsBlog.com_.png",
              "alt": "Scenes From the month_December 2019_EverydayAccountsBlog.com",
              "title": null
            },
            "marks": [
              {
                "type": "link",
                "attrs": {
                  "href": "https://www.everydayaccountsblog.com/wp-content/uploads/2020/01/SFTM_December-2019_1_EverydayAccountsBlog.com_.png",
                  "title": null
                }
              }
            ]
          },
          {
            "type": "text",
            "text": "(1) December started off with an exciting appointment to see our little baby for his anatomy scan! Hi there, cutie!"
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "(2) We finished decorating the house for Christmas in the first few days of the month, and it was wonderful. I had a lot of fun decorating our first home for our first holiday season in it. (It makes me very sad that as I write this post I'm also talking to Daniel about when we should take it down. How is it already time?)"
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "(3) This snowman is a new addition to our Christmas decor, and Carson thought he had a pretty cool nose."
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "(4) Also during the first week, I had a fun outing with my friend and neighbor Rebecca to hear Jamie Ivey speak at a women's Christmas event hosted by Rebecca's church. Jamie had such a great message, and it was nice to be in a festive venue surrounded by other Christian women."
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "image",
            "attrs": {
              "src": "images/SFTM_December-2019_2_EverydayAccountsBlog.com_.png",
              "alt": "Scenes From the month_December 2019_EverydayAccountsBlog.com",
              "title": null
            },
            "marks": [
              {
                "type": "link",
                "attrs": {
                  "href": "https://www.everydayaccountsblog.com/wp-content/uploads/2020/01/SFTM_December-2019_2_EverydayAccountsBlog.com_.png",
                  "title": null
                }
              }
            ]
          },
          {
            "type": "text",
            "text": "(1) My cousin Rebecca's wedding was the first weekend of December. It was a beautiful evening wedding in Dallas. There were a lot of my extended family members there from different states, and it was great to visit with them (and dance with them - we all had a great time!). We made a one-night trip so that we could get back for all the Christmas events at home the rest of the weekend."
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "(2) As you can see, Santa photos did not go nearly as well as they did last year (he LOVED Santa when he was 9 months). This Santa was great though - very classic. We took these photos the afternoon after our drive back from the wedding in Dallas the previous evening, so he could have just been tired. Our community center puts on the the best events! This one not only had Santa photos, but also Christmas cookie decorating, a train ride, live Christmas music for kids, and snacks!"
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "(3) My mom still comes to watch Carson every Monday. She sent me this sweet photo of him on the swing a few weeks ago. Just what I needed during the middle of a long work day!"
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "(4) Crazy hair, don't care!"
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "image",
            "attrs": {
              "src": "images/SFTM_December-2019_3_EverydayAccountsBlog.com_.png",
              "alt": "Scenes From the month_December 2019_EverydayAccountsBlog.com",
              "title": null
            }
          },
          {
            "type": "text",
            "text": "(1) Carson brought this ADORABLE ornament home from daycare. Inside, there is a ribbon that is the length of his current height. I will treasure this forever."
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "(2) We took a family drive out to the Johnson City Lights Spectacular one weekend. What a beautiful little Texas town! The Lights Spectacular event was great. I hope we can do this every December as a family tradition."
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "(3) Carson and his friend (*cough* future girlfriend) Loretta at our friends' house for a Christmas music party!"
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "(4) Here's a little glimpse of the Christmas lights on our first home!"
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "image",
            "attrs": {
              "src": "images/SFTM_December-2019_4_EverydayAccountsBlog.com_.png",
              "alt": "Scenes From the month_December 2019_EverydayAccountsBlog.com",
              "title": null
            }
          },
          {
            "type": "text",
            "text": "(1) The Friday before Christmas we packed up for our big Christmas trip! My parents picked us up, and our first stop was a visit to Mimi and Papa in Waco. Carson LOVES Mimi and Papa and says \"Mimi\" and \"Papa\" over and over again, both when he sees them in person and in photos and when he's not looking at them."
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "(2) The next day we finished our drive to East Texas for our annual Christmas gathering with the family on my dad's side. My grandmother Mama Dee is one of the most Christmas-obsessed people I've met, and her home was completely decked out. She looks forward to and plans for this family gathering all year long. This is Carson and Papa Dee playing with the train around one of their Christmas trees."
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "(3) Present opening at these events are a big deal. We go around and open one-by-one. And this is only about half the group in this photo!"
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "(4) The next day, Daniel, Carson, and I flew to Tampa for Christmas week with Daniel's grandmother and family in St. Petersburg. One of our first outings was lunch out, and Carson had fun showing us his \"scary\" face (my mother-in-law followed his lead!)."
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "image",
            "attrs": {
              "src": "images/SFTM_December-2019_5_EverydayAccountsBlog.com_.png",
              "alt": "Scenes From the month_December 2019_EverydayAccountsBlog.com",
              "title": null
            },
            "marks": [
              {
                "type": "link",
                "attrs": {
                  "href": "https://www.everydayaccountsblog.com/wp-content/uploads/2020/01/SFTM_December-2019_5_EverydayAccountsBlog.com_.png",
                  "title": null
                }
              }
            ]
          },
          {
            "type": "text",
            "text": "(1) Daniel and I went out for a date night while in Florida. We enjoyed dinner out at a ramen restaurant, gelato at a shop on the St. Pete Beach Walk, and looking at the lights displays along the water. I especially loved the boats decked out in Christmas lights!"
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "(2) Last year we started a Christmas Eve jammies tradition. This year, we had Charlie Brown Christmas pajamas! Big smiles!"
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "(3) Our hotel had a huge Enchant Christmas display in the lobby that Carson enjoyed. Enchant Christmas is a large Christmas event with a gorgeous lights maze, market, and ice skating trail, and it was held only in three cities in the US. St. Pete just happened to be one of those cities! We went to that event the day after Christmas (see below)."
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "(4) Carson was unusually cuddly on Christmas morning. I love these rare moments. We traveled with one present from Santa for him to open Christmas morning, and he was such a happy little boy that morning. After the present, cuddles, and coffee for Mom and Dad, Carson enjoyed running around the very empty conference halls of the hotel."
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "image",
            "attrs": {
              "src": "images/SFTM_December-2019_6_EverydayAccountsBlog.com_.png",
              "alt": "Scenes From the month_December 2019_EverydayAccountsBlog.com",
              "title": null
            },
            "marks": [
              {
                "type": "link",
                "attrs": {
                  "href": "https://www.everydayaccountsblog.com/wp-content/uploads/2020/01/SFTM_December-2019_6_EverydayAccountsBlog.com_.png",
                  "title": null
                }
              }
            ]
          },
          {
            "type": "text",
            "text": "(1) This is the family photo we took at Enchant Christmas (see #3 for the above photo). It was a later evening for Carson, but he had a great time looking at all the beautiful lights and running around in the maze."
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "(2) Carson snuggling Daniel's Grandma, who wants Carson to call her Granny. They had such a sweet bond during this week."
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "(3) After our fun week in Florida was over, we flew to San Antonio for a couple days with my parents, brother, sister, and her fiancé. We had lots of wonderful family time."
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "(4) We ended the year with a quiet New Year's Eve at home. We did Santa presents for Carson on New Year's morning, so we set up the gifts on NYE, ate a cheeseboard, watched Mary Poppins Returns, and somehow actually stayed up until midnight!"
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "I hope everyone has a wonderful start to 2020! Click "
          },
          {
            "type": "text",
            "marks": [
              {
                "type": "link",
                "attrs": {
                  "href": "http://www.everydayaccountsblog.com/category/scenes-from-the-week/",
                  "title": null
                }
              }
            ],
            "text": "here"
          },
          {
            "type": "text",
            "text": " to see all of my previous Scenes From the Week posts and "
          },
          {
            "type": "text",
            "marks": [
              {
                "type": "link",
                "attrs": {
                  "href": "https://www.everydayaccountsblog.com/category/scenes-from-the-month/",
                  "title": null
                }
              }
            ],
            "text": "here"
          },
          {
            "type": "text",
            "text": " for all of my Scenes From the Month posts."
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "marks": [
              {
                "type": "em"
              }
            ],
            "text": "{Thanks for reading! Want to know a little more about me? I’m a CPA learning how to "
          },
          {
            "type": "text",
            "marks": [
              {
                "type": "em"
              },
              {
                "type": "link",
                "attrs": {
                  "href": "https://www.everydayaccountsblog.com/tag/work/",
                  "title": null
                }
              }
            ],
            "text": "balance a career"
          },
          {
            "type": "text",
            "marks": [
              {
                "type": "em"
              }
            ],
            "text": " with "
          },
          {
            "type": "text",
            "marks": [
              {
                "type": "em"
              },
              {
                "type": "link",
                "attrs": {
                  "href": "https://www.everydayaccountsblog.com/tag/baby-boy/",
                  "title": null
                }
              }
            ],
            "text": "motherhood"
          },
          {
            "type": "text",
            "marks": [
              {
                "type": "em"
              }
            ],
            "text": " and "
          },
          {
            "type": "text",
            "marks": [
              {
                "type": "em"
              },
              {
                "type": "link",
                "attrs": {
                  "href": "https://www.everydayaccountsblog.com/category/travel-with-me/",
                  "title": null
                }
              }
            ],
            "text": "regular travel"
          },
          {
            "type": "text",
            "marks": [
              {
                "type": "em"
              }
            ],
            "text": " while "
          },
          {
            "type": "text",
            "marks": [
              {
                "type": "em"
              },
              {
                "type": "link",
                "attrs": {
                  "href": "https://www.everydayaccountsblog.com/tag/austin/",
                  "title": null
                }
              }
            ],
            "text": "planting roots at home in the Austin, TX area"
          },
          {
            "type": "text",
            "marks": [
              {
                "type": "em"
              }
            ],
            "text": ". When I’m not exploring my home city with my husband Daniel and baby boy Carson or cuddling with my chubby orange cat Banana, I’m probably either out on a playdate with my son or "
          },
          {
            "type": "text",
            "marks": [
              {
                "type": "em"
              },
              {
                "type": "link",
                "attrs": {
                  "href": "https://www.everydayaccountsblog.com/tag/travel-prep/",
                  "title": null
                }
              }
            ],
            "text": "planning"
          },
          {
            "type": "text",
            "marks": [
              {
                "type": "em"
              }
            ],
            "text": ", packing for, traveling to, or daydreaming about our next adventure. After all, my"
          },
          {
            "type": "text",
            "text": " "
          },
          {
            "type": "text",
            "marks": [
              {
                "type": "em"
              },
              {
                "type": "link",
                "attrs": {
                  "href": "https://www.everydayaccountsblog.com/2016/04/my-travel-mug-collection-updated/",
                  "title": null
                }
              }
            ],
            "text": "travel mug collection"
          },
          {
            "type": "text",
            "text": " "
          },
          {
            "type": "text",
            "marks": [
              {
                "type": "em"
              }
            ],
            "text": "is never complete. If you have wanderlust too, be sure to follow me on"
          },
          {
            "type": "text",
            "text": " "
          },
          {
            "type": "text",
            "marks": [
              {
                "type": "em"
              },
              {
                "type": "link",
                "attrs": {
                  "href": "https://www.instagram.com/emily_abernathy/",
                  "title": null
                }
              }
            ],
            "text": "Instagram"
          },
          {
            "type": "text",
            "text": " "
          },
          {
            "type": "text",
            "marks": [
              {
                "type": "em"
              }
            ],
            "text": "(and InstaStories!)__,"
          },
          {
            "type": "text",
            "text": " "
          },
          {
            "type": "text",
            "marks": [
              {
                "type": "em"
              },
              {
                "type": "link",
                "attrs": {
                  "href": "https://www.pinterest.com/e_abernathy/",
                  "title": null
                }
              }
            ],
            "text": "Pinterest"
          },
          {
            "type": "text",
            "marks": [
              {
                "type": "em"
              }
            ],
            "text": ", and "
          },
          {
            "type": "text",
            "marks": [
              {
                "type": "em"
              },
              {
                "type": "link",
                "attrs": {
                  "href": "https://www.facebook.com/everydayaccounts/",
                  "title": null
                }
              }
            ],
            "text": "Facebook"
          },
          {
            "type": "text",
            "marks": [
              {
                "type": "em"
              }
            ],
            "text": ","
          },
          {
            "type": "text",
            "text": " "
          },
          {
            "type": "text",
            "marks": [
              {
                "type": "em"
              }
            ],
            "text": "or"
          },
          {
            "type": "text",
            "text": " "
          },
          {
            "type": "text",
            "marks": [
              {
                "type": "em"
              },
              {
                "type": "link",
                "attrs": {
                  "href": "https://www.bloglovin.com/blogs/everyday-accounts-11840161",
                  "title": null
                }
              }
            ],
            "text": "subscribe to my blog"
          },
          {
            "type": "text",
            "marks": [
              {
                "type": "em"
              }
            ],
            "text": "!__}"
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "marks": [
              {
                "type": "link",
                "attrs": {
                  "href": "https://www.bloglovin.com/blog/20250381/?claim=anjqj79zt2m",
                  "title": null
                }
              }
            ],
            "text": "Follow my blog with Bloglovin"
          }
        ]
      }
    ]
  }
}