{
  "data": {
    "title": "Scenes From the Week // 03",
    "date": "2014-08-01",
    "categories": [
      "scenes-from-the-week"
    ],
    "tags": [
      "concert",
      "daily-life",
      "food",
      "metro",
      "music",
      "public-transportation",
      "the-everyday"
    ],
    "coverImage": "https://www.everydayaccountsblog.com/wp-content/uploads/2014/07/20140731-225753-82673598.jpg",
    "id": "2734",
    "slug": "scenes-from-the-week-03"
  },
  "content": {
    "type": "doc",
    "content": [
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "Happy Friday! I hope that everyone had a good week with a fun weekend to look forward to! I have started this Scenes From the Week series  so that I can share both the more memorable events in my week as well as the small things that made me smile. Here is a glimpse into scenes from my last week of July 2014 (crazy!):"
          }
        ]
      },
      {
        "type": "heading",
        "attrs": {
          "level": 1
        },
        "content": [
          {
            "type": "text",
            "text": "Monday"
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "Monday morning I took the metro to work for the first time. DC's new silver line opened up last weekend, and it provides transportation out to Tysons Corner where I work. I was really looking forward to taking public transportation every day because I loved the idea of being able to read or do other things while commuting. Well, it was quite a hike because I had to take a shuttle my apartment to the metro (10 min), get on the blue line (10 min), get on the silver line (25 min), and then walk from the metro station to my office (10 min). If you add in waiting time into there, it takes over an hour to get to work. I would normally be fine with that because the traffic in this area is so unpredictable and my commute by car varies from 30 minutes to an hour and a half (once it took two hours!), but the worst part was that I was sweating quite a bit by the time I got to my cube at work from the walk. So, I haven't made the decision on if I'm going to try to stick it out or not."
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "[caption id=\"\" align=\"alignnone\" width=\"669\"]"
          },
          {
            "type": "image",
            "attrs": {
              "src": "images/20140731-225114-82274609.jpg",
              "alt": "20140731-225114-82274609.jpg",
              "title": null
            }
          },
          {
            "type": "text",
            "text": " At the new Greensboro metro station by my office[/caption]"
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "On a positive note, taking the silver line that day worked out perfectly after work because we went to a concert in DC. The silver line is a straight shot into the city, and there is a stop right in front of my husband's office on Capitol Hill! I was able to change clothes and drop off my work bag at his office before we went out to dinner and the concert. We saw "
          },
          {
            "type": "text",
            "marks": [
              {
                "type": "link",
                "attrs": {
                  "href": "http://www.matesofstate.com/",
                  "title": null
                }
              }
            ],
            "text": "Mates of State"
          },
          {
            "type": "text",
            "text": " play at the 9:30 Club after having dinner at El Rey. Dinner was great (yummy street tacos), and the concert was awesome!"
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "image",
            "attrs": {
              "src": "images/20140731-224625-81985599.jpg",
              "alt": "20140731-224625-81985599.jpg",
              "title": null
            }
          }
        ]
      },
      {
        "type": "heading",
        "attrs": {
          "level": 1
        },
        "content": [
          {
            "type": "text",
            "text": "Tuesday"
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "Tuesday evening I wasted three hours of my life watching The Bachelorette season finale while attempting to draft some blog posts. The show had its good moments, but, really, three hours?? As much as I feel like I should, I just can't stop watching this franchise.... It is so entertaining in a weird, addicting kind of way."
          }
        ]
      },
      {
        "type": "heading",
        "attrs": {
          "level": 1
        },
        "content": [
          {
            "type": "text",
            "text": "Wednesday"
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "I went to lunch with some co-workers at Noodles & Company and ordered the Pesto Cavatappi. Daniel took the silver line to my office after work, and we then went to try Smashburger for the first time. I ordered their classic burger and smashfries and was very impressed! Clearly, this was not a day for healthy eating."
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "That evening, I pre-ordered Chris Guillebeau's new book "
          },
          {
            "type": "text",
            "marks": [
              {
                "type": "link",
                "attrs": {
                  "href": "http://www.amazon.com/Happiness-Pursuit-Finding-Quest-Purpose/dp/0385348843/ref=sr_1_4?s=books&ie=UTF8&qid=1406860873&sr=1-4&keywords=chris+guillebeau",
                  "title": null
                }
              }
            ],
            "text": "The Happiness of Pursuit: Finding the Quest That Will Bring Purpose to Your Life"
          },
          {
            "type": "text",
            "text": ". I've enjoyed his books in the past, so I'm looking forward to reading this one when it comes to me in the mail in September!"
          }
        ]
      },
      {
        "type": "heading",
        "attrs": {
          "level": 1
        },
        "content": [
          {
            "type": "text",
            "text": "Thursday"
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "I worked from home, and Daniel worked at his office that is closer to our apartment, so we were able to meet for lunch for what I believe was the first time ever during a work day. We went to our favorite little cafe near the apartment and both ordered tuna sandwiches and salad."
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "image",
            "attrs": {
              "src": "images/20140731-224626-81986304.jpg",
              "alt": "20140731-224626-81986304.jpg",
              "title": null
            }
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "This was a pretty long work day for both of us, so we scrounged and had leftovers for dinner. I cleaned the apartment, and once again, I packed my bags for our trip to Florida this weekend! We are visiting Daniel's Grandma in St. Petersburg."
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "What did you do this week?"
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "image",
            "attrs": {
              "src": "images/dailydiariesbutton1.png",
              "alt": "Daily Diaries with The Lotus Creative",
              "title": null
            },
            "marks": [
              {
                "type": "link",
                "attrs": {
                  "href": "http://thelotuscreative.com/category/dailydiaries/",
                  "title": null
                }
              }
            ]
          }
        ]
      }
    ]
  }
}