{
  "data": {
    "title": "Scenes From the Week // 05",
    "date": "2014-08-15",
    "categories": [
      "scenes-from-the-week"
    ],
    "tags": [
      "coffee",
      "robin-williams",
      "the-everyday",
      "trader-joes"
    ],
    "id": "2888",
    "slug": "scenes-from-the-week-05"
  },
  "content": {
    "type": "doc",
    "content": [
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "Happy Friday! Welcome to my Scenes From the Week series. In these posts I share the highlights from my week - from memorable events to the small things that made me smile. Here is a glimpse into this past week:"
          }
        ]
      },
      {
        "type": "heading",
        "attrs": {
          "level": 1
        },
        "content": [
          {
            "type": "text",
            "text": "Monday"
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "On my way home from work, I stopped at Trader Joe's to pick up a bunch of groceries - mostly food for lunches to pack for work and frozen dinners for Daniel to eat since I was going to be eating dinner at the office the majority of the week. While taking a peek at the frozen dessert section, something amazing caught my eye. Speculoos Cookie Butter Ice Cream!! I love Trader Joe's Speculoos cookies (just think cinnamon cookies that go really well with coffee), and their Cookie Butter is awesome, AND I love vanilla ice cream mixed with cookies (but not anything chocolate - I don't like chocolate). So this was a match made in heaven. Daniel and I had planned on having a healthy week, but that pretty much went down the drain the second I brought this home. It's gone now, and we are going to resist buying it for at least a few weeks, but I highly recommend it!"
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "image",
            "attrs": {
              "src": "images/IMG_5716-0.jpg",
              "alt": "IMG_5716-0.JPG",
              "title": null
            }
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "Monday was also the tragic day that Robin Williams passed away. It was nice to have ice cream to cheer us up that evening."
          }
        ]
      },
      {
        "type": "heading",
        "attrs": {
          "level": 1
        },
        "content": [
          {
            "type": "text",
            "text": "Tuesday"
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "It poured all day long. I actually love the rain when I'm not stuck getting drenched in it - for some reason, it makes me more productive to know it's raining outside."
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "For lunch I met my friend Catherine at Pho Deluxe. I had never had pho before, and I loved it! It is a Vietnamese beef and noodle soup which was perfect for a rainy day. I'm looking forward to going with Daniel so that he can give pho a try."
          }
        ]
      },
      {
        "type": "heading",
        "attrs": {
          "level": 1
        },
        "content": [
          {
            "type": "text",
            "text": "Wednesday"
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "At work I decided to listen to all of my music on my iPhone on shuffle mode. I like to do that sometimes to remind myself of the music that I have and love and often forget about."
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "That evening I was home for dinner, so we heated up some Trader Joe's turkey corn dogs. While we ate, we watched an episode of Suits, one of our favorite shows of the summer."
          }
        ]
      },
      {
        "type": "heading",
        "attrs": {
          "level": 1
        },
        "content": [
          {
            "type": "text",
            "text": "Thursday"
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "In the evening we drove over to Buzz  Bakery (one of our favorite local coffee shops) to work. I did some blogging and blog reading and a little trip planning (I can't stop!). While we were there, Daniel ordered their pimiento grilled cheese for dinner. I had a little bite, and we decided that we are going to come here just for grilled cheeses sometime because it was so good!"
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "[caption id=\"\" align=\"alignnone\" width=\"967\"]"
          },
          {
            "type": "image",
            "attrs": {
              "src": "images/IMG_5718-1.jpg",
              "alt": "IMG_5718-1.JPG",
              "title": null
            }
          },
          {
            "type": "text",
            "text": " How cute is this coffee shop?![/caption]"
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "How was your week?"
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "image",
            "attrs": {
              "src": "images/dailydiariesbutton1.png",
              "alt": "Daily Diaries with The Lotus Creative",
              "title": null
            },
            "marks": [
              {
                "type": "link",
                "attrs": {
                  "href": "http://thelotuscreative.com/category/dailydiaries/",
                  "title": null
                }
              }
            ]
          }
        ]
      }
    ]
  }
}