{
  "data": {
    "title": "2016 Favorites | Travel Tech",
    "date": "2016-03-25",
    "categories": [
      "seasonal-favorites",
      "travel-other"
    ],
    "tags": [
      "favorites",
      "technology",
      "tools",
      "travel-favorites"
    ],
    "coverImage": "https://www.everydayaccountsblog.com/wp-content/uploads/2016/03/Travel-Favorites_Tech.jpg",
    "id": "5880",
    "slug": "2016-favorites-travel-tech"
  },
  "content": {
    "type": "doc",
    "content": [
      {
        "type": "paragraph",
        "content": [
          {
            "type": "image",
            "attrs": {
              "src": "images/Travel-Favorites_Tech.jpg",
              "alt": "Travel Favorites_Tech",
              "title": null
            },
            "marks": [
              {
                "type": "link",
                "attrs": {
                  "href": "http://www.everydayaccountsblog.com/wp-content/uploads/2016/03/Travel-Favorites_Tech.jpg",
                  "title": null
                }
              }
            ]
          },
          {
            "type": "text",
            "text": "Since my husband and I just returned from backpacking around Europe for a couple of months, I thought I'd share some of my travel favorites that  proved to be really valuable to us. This is not a packing list - I'll post one of those separately very soon. This is just what I genuinely loved and used throughout all of January and February and half of March while traveling around. They are tried and true! I'm sure I will use them again on future trips. I'll split my travel favorites into three posts: Tech, "
          },
          {
            "type": "text",
            "marks": [
              {
                "type": "link",
                "attrs": {
                  "href": "http://www.everydayaccountsblog.com/2016/04/2016-favorites-packing-gear/",
                  "title": null
                }
              }
            ],
            "text": "Packing Gear"
          },
          {
            "type": "text",
            "text": ", and "
          },
          {
            "type": "text",
            "marks": [
              {
                "type": "link",
                "attrs": {
                  "href": "http://www.everydayaccountsblog.com/2016/04/2016-favorites-clothing-makeup/",
                  "title": null
                }
              }
            ],
            "text": "Clothing & Products"
          },
          {
            "type": "text",
            "text": ". Today's post is about our favorite tech and apps that we used on our trip!"
          }
        ]
      },
      {
        "type": "heading",
        "attrs": {
          "level": 3
        },
        "content": [
          {
            "type": "text",
            "marks": [
              {
                "type": "strong"
              }
            ],
            "text": "Offline Google Maps"
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "Offline Google Maps is probably my FAVORITE favorite on this list. Daniel and I made the decision to not purchase an international phone plan for our trip. Instead, we thought we'd possibly buy SIM cards abroad or go without and just use wireless internet as we could find it. We ended up buying a SIM card in the UK, but we learned that you have to buy a new SIM card for every country you go to, and that was going to get both a little expensive and quite inconvenient when traveling to six additional countries. So once we left the UK, we went without mobile data and were at the mercy of wifi availability for the rest of the trip. Well, we figured out a way to make it work just fine, thanks to offline Google Maps!"
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "image",
            "attrs": {
              "src": "images/2016-03-25-10.51.49-577x1024.png",
              "alt": "2016-03-25 10.51.49",
              "title": null
            },
            "marks": [
              {
                "type": "link",
                "attrs": {
                  "href": "http://www.everydayaccountsblog.com/wp-content/uploads/2016/03/2016-03-25-10.51.49.png",
                  "title": null
                }
              }
            ]
          },
          {
            "type": "text",
            "text": "This is a screenshot from my phone of my offline Rome map. I'll go into my detailed travel planning strategy in another post, but here is what I do in a nutshell. First, I download the map on my Google Maps app through the \"download\" feature that pops up once you search for a city. Then, once I've figured out the sites and restaurants I have at least somewhat of an interest in going to, I'll go in and \"save\" them all onto my map. Note that both of these steps have to be done while connected to the internet, so I usually would do this the night before at our hotel or Airbnb using wifi. Then, the next day, my map is all ready to go! While you can't get walking directions offline, you can see where you are on the map currently by looking for the little blue GPS dot, and with an offline map, you can zoom in and see all of the street names. Once you make sure you are walking in the right direction, it is really easy to find your way to one of your saved locations!"
          }
        ]
      },
      {
        "type": "heading",
        "attrs": {
          "level": 3
        },
        "content": [
          {
            "type": "text",
            "marks": [
              {
                "type": "strong"
              }
            ],
            "text": "Google Play"
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "Daniel has been using Google Play for a long time, but I held off because I didn't want to abandon my trusty iTunes, and I often listen to music through Pandora. However, when Google Play released their family plan, I decided to give it a try since we'd only have to pay a few dollars more a month on top of Daniel's plan. I'm so glad I did! Google Play allows you download all kinds of albums to listen to offline at no additional cost. They are saved right onto your phone as if you own them. I definitely put this to use since we took many, many long train rides."
          }
        ]
      },
      {
        "type": "heading",
        "attrs": {
          "level": 3
        },
        "content": [
          {
            "type": "text",
            "marks": [
              {
                "type": "strong"
              }
            ],
            "text": "TripAdvisor"
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "I've been a fan of TripAdvisor for a long time, and it just gets better and better as more and more people post reviews in more and more cities. It has gotten to the point where even locals are posting reviews, so I don't feel like every highly recommended restaurant is touristy. Recently the TripAdvisor app has seen a lot of improvement. Most notably, they allow you to save all of the reviews for a city offline! Not every city has this feature, but most of the places we visited did. This was a game changer! It allowed us to not have to fully plan out our day before leaving our hotel wifi. If we found our way to a new area of a city by dinner time, we were able to look up specific restaurants we passed to make sure they weren't terrible! If you have a phone plan or SIM card while traveling, this feature won't be a big help to you, but I believe that this in combination with offline Google maps allow for an easy data-free vacation."
          }
        ]
      },
      {
        "type": "heading",
        "attrs": {
          "level": 3
        },
        "content": [
          {
            "type": "text",
            "marks": [
              {
                "type": "strong"
              }
            ],
            "text": "Blog Posts"
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "If you are reading this post, you probably already know about the abundance of travel tips and information you can find in the blogging community. I found so many travel ideas, restaurant recommendations, and packing tips by looking at posts written by various Europe travel bloggers. My favorites include "
          },
          {
            "type": "text",
            "marks": [
              {
                "type": "link",
                "attrs": {
                  "href": "http://theoverseasescape.com/",
                  "title": null
                }
              }
            ],
            "text": "The Overseas Escape"
          },
          {
            "type": "text",
            "text": ",  "
          },
          {
            "type": "text",
            "marks": [
              {
                "type": "link",
                "attrs": {
                  "href": "http://landofmarvels.com/",
                  "title": null
                }
              }
            ],
            "text": "Land of Marvels"
          },
          {
            "type": "text",
            "text": ", and "
          },
          {
            "type": "text",
            "marks": [
              {
                "type": "link",
                "attrs": {
                  "href": "http://welltraveledwife.com/",
                  "title": null
                }
              }
            ],
            "text": "Well-Traveled Wife"
          },
          {
            "type": "text",
            "text": ".   I also use blogs to keep up with the latest travel hacking news, one of my favorite new hobbies that allows us to travel without breaking the bank. My favorite way to keep up with blogs is to subscribe to them on the Bloglovin' app."
          }
        ]
      },
      {
        "type": "heading",
        "attrs": {
          "level": 3
        },
        "content": [
          {
            "type": "text",
            "marks": [
              {
                "type": "strong"
              }
            ],
            "text": "Rick Steves Audio Europe"
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "I know, I know - some of you are probably shaking your heads right now. But we have really come to love Rick Steves! We've found most of his tips and recommendations to be accurate. We heard about his free audio walking tours from a friend and first tried them out on our Austria and Germany Christmas markets trip last year. We love them! You just download the app, pick which cities you are going to, and download the walking tours. Then you bring your headphones out with you for the day and put them in to take the tour whenever you get to the starting point. The app also comes with a handy map that shows where you should be for each part of the tour, in case you get lost when listening to the verbal directions. Yes, Rick is very cheesy, but the mix of historical and current day information he gives is very good. And sometimes it's nice to not be bound to a group of other tourists on an official walking tour. He has all kinds of information to download in the app, but we have only used the tracks labeled \"Walking Tour\"."
          }
        ]
      },
      {
        "type": "heading",
        "attrs": {
          "level": 3
        },
        "content": [
          {
            "type": "text",
            "marks": [
              {
                "type": "strong"
              }
            ],
            "text": "Pinterest"
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "This goes hand in hand with my blog posts section above, but I've found that searching for travel blog posts on a specific place is much easier to do on Pinterest than it is in a Google search! I definitely used the Pinterest app a lot for planning on this trip."
          }
        ]
      },
      {
        "type": "heading",
        "attrs": {
          "level": 3
        },
        "content": [
          {
            "type": "text",
            "marks": [
              {
                "type": "strong"
              }
            ],
            "text": "iPhone Camera"
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "I take all of my pictures on my iPhone. Yes, there are some big disadvantages to that - mostly that it's nearly impossible to take good pictures in a dimly-lit room or outside at night. However, I haven't had the budget for a nice camera so far, so I've made it work. Daniel has an Android phone that actually takes much better pictures in the dark, and it is nice to not have to lug around anything but my purse while traveling by foot all day long. Plus we found ourselves walking through a LOT of rain this trip, so I'm glad I didn't have to worry about a camera. I've definitely come home with tons of beautiful trip photos taken straight from my little phone!"
          }
        ]
      },
      {
        "type": "heading",
        "attrs": {
          "level": 3
        },
        "content": [
          {
            "type": "text",
            "marks": [
              {
                "type": "strong"
              }
            ],
            "text": "Dropbox"
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "The Dropbox app is very handy. Since I take all of my pictures on my iPhone (see above), I'm able to back up all of my photos through the app as soon as I'm connected to wifi. I pay for extra storage since I store all of my photos on Dropbox, but you can use Dropbox for free if you don't need much space."
          }
        ]
      },
      {
        "type": "heading",
        "attrs": {
          "level": 3
        },
        "content": [
          {
            "type": "text",
            "marks": [
              {
                "type": "strong"
              }
            ],
            "text": "Hola"
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "Hola is a Chrome extension that hides your current location from the websites you are visiting. I had never used it before this trip. At first, we were really bummed to find out we couldn't access our Hulu subscription, Pandora, or some Netflix shows and movies from Europe, but once we learned about Hola I downloaded it, and we were immediately able to access anything we wanted from Europe. I realize most people probably don't care to spend time watching TV while traveling, but we did because we needed some down time while traveling non-stop for nearly three months."
          }
        ]
      },
      {
        "type": "heading",
        "attrs": {
          "level": 3
        },
        "content": [
          {
            "type": "text",
            "marks": [
              {
                "type": "strong"
              }
            ],
            "text": "Portable Charger"
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "I think most people use a portable charger when traveling these days. They give you one less thing to worry about while out exploring all day. Since I use my iPhone to take pictures, access my offline Google maps, access TripAdvisor, and various other things while traveling, my battery dies much more quickly than when I'm home. Daniel carried our portable charger around in his backpack, and we didn't have any trouble with it. It was also very handy for the several train rides I forgot to charge my iPad for, and I can't take a train ride without access to my eBooks stored on my iPad! :)"
          }
        ]
      },
      {
        "type": "heading",
        "attrs": {
          "level": 3
        },
        "content": [
          {
            "type": "text",
            "marks": [
              {
                "type": "strong"
              }
            ],
            "text": "FaceTime"
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "Most people know and love FaceTime, but I think the best part about it is being able to call other iPhone users internationally for free! We used it to call family and friends which was a must since we were away for so long."
          }
        ]
      },
      {
        "type": "heading",
        "attrs": {
          "level": 3
        },
        "content": [
          {
            "type": "text",
            "marks": [
              {
                "type": "strong"
              }
            ],
            "text": "Venmo"
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "Venmo is an app that allows you to make calls from anywhere to anywhere. I found this useful for a couple of reasons: 1) Not everyone has iPhone to use FaceTime with, and 2) You can call any (800) number for free on this app. I had a couple of work issues come up that required me to call my company's help line, so it was very nice to have a free way to reach them."
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "That's it! I hope you find this list useful for your upcoming travels! Please comment below if you have any other travel tech favorites. I'm always looking for new ideas!"
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "marks": [
              {
                "type": "em"
              }
            ],
            "text": "{If you'd like to see my re-caps and travel recommendations for the places we visited on our 2.5 month trip across Western Europe,  click "
          },
          {
            "type": "text",
            "marks": [
              {
                "type": "em"
              },
              {
                "type": "link",
                "attrs": {
                  "href": "http://www.everydayaccountsblog.com/tag/abernathy-adventure/",
                  "title": null
                }
              }
            ],
            "text": "here"
          },
          {
            "type": "text",
            "marks": [
              {
                "type": "em"
              }
            ],
            "text": " to check out all of my posts from this adventure!}"
          }
        ]
      },
      {
        "type": "heading",
        "attrs": {
          "level": 2
        },
        "content": [
          {
            "type": "text",
            "text": "Like it? Pin it!"
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "image",
            "attrs": {
              "src": "images/Travel-Favorites_Tech_Pinterest-683x1024.jpg",
              "alt": "Travel Favorites_Tech_Pinterest",
              "title": null
            },
            "marks": [
              {
                "type": "link",
                "attrs": {
                  "href": "http://www.everydayaccountsblog.com/wp-content/uploads/2016/03/Travel-Favorites_Tech_Pinterest.jpg",
                  "title": null
                }
              }
            ]
          }
        ]
      }
    ]
  }
}