{
  "data": {
    "title": "Scenes From the Week // 20",
    "date": "2015-06-01",
    "categories": [
      "scenes-from-the-week"
    ],
    "id": "4314",
    "slug": "scenes-from-the-week-20"
  },
  "content": {
    "type": "doc",
    "content": [
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "Happy Monday! Welcome to my Scenes From the Week series. In these quick posts, I share the highlights from my previous week ranging from the simple, everyday things to the more memorable events."
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "image",
            "attrs": {
              "src": "images/BIRU-WP-20150531T213200GMT-0500.jpg",
              "alt": "5/31/15",
              "title": null
            },
            "marks": [
              {
                "type": "link",
                "attrs": {
                  "href": "http://www.everydayaccountsblog.com/wp-content/uploads/2015/05/BIRU-WP-20150531T213200GMT-0500.jpg",
                  "title": null
                }
              }
            ]
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "The highlight of the week was the celebration of my mom's birthday all weekend long! My dad surprised her with a trip to Austin where they stayed in a nice hotel downtown near our apartment. The weekend consisted of a walk along the river (pictured here), tons of great Austin-y food, a manicure and pedicure outing for us girls, a movie night, and a bonus birthday celebration for my sister Elizabeth (whose birthday is this coming Wednesday). It was a great weekend with family!"
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "marks": [
              {
                "type": "strong"
              }
            ],
            "text": "Not pictured:"
          }
        ]
      },
      {
        "type": "bullet_list",
        "attrs": {
          "tight": true
        },
        "content": [
          {
            "type": "list_item",
            "content": [
              {
                "type": "paragraph",
                "content": [
                  {
                    "type": "text",
                    "text": "We started cooking again this week! We made some really great recipes from a couple of our cookbooks. It felt nice to be back in the kitchen together and to enjoy some great home-cooked meals."
                  }
                ]
              }
            ]
          },
          {
            "type": "list_item",
            "content": [
              {
                "type": "paragraph",
                "content": [
                  {
                    "type": "text",
                    "text": "Since you are reading this, you already know this, but I'm back to blogging! I feel like it will take some adjusting to get back into it after a long, very busy season at work, but I know it's the right time."
                  }
                ]
              }
            ]
          },
          {
            "type": "list_item",
            "content": [
              {
                "type": "paragraph",
                "content": [
                  {
                    "type": "text",
                    "text": "We started watching The Killing again. I raved about this show on the blog last year. We ended up going really quickly through the first two seasons and forcing ourselves to stop. Well, we have decided to pick it up again. At least there are only two more seasons!"
                  }
                ]
              }
            ]
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "And that was our week! Happy Monday!"
          }
        ]
      }
    ]
  }
}