{
  "data": {
    "title": "June Goals",
    "date": "2015-06-05",
    "categories": [
      "monthly-goals"
    ],
    "tags": [
      "blogging",
      "exercise",
      "goals-2",
      "travel"
    ],
    "id": "4327",
    "slug": "june-goals"
  },
  "content": {
    "type": "doc",
    "content": [
      {
        "type": "heading",
        "attrs": {
          "level": 3
        },
        "content": [
          {
            "type": "image",
            "attrs": {
              "src": "images/BIRU-WP-20150604T214614GMT-0500.jpg",
              "alt": "6/4/15",
              "title": null
            },
            "marks": [
              {
                "type": "link",
                "attrs": {
                  "href": "http://www.everydayaccountsblog.com/wp-content/uploads/2015/06/BIRU-WP-20150604T214614GMT-0500.jpg",
                  "title": null
                }
              }
            ]
          }
        ]
      },
      {
        "type": "heading",
        "attrs": {
          "level": 3
        },
        "content": [
          {
            "type": "text",
            "text": "Finish the "
          },
          {
            "type": "text",
            "marks": [
              {
                "type": "link",
                "attrs": {
                  "href": "https://www.creativelive.com/courses/make-your-dream-trip-reality-chris-guillebeau-stephanie-zito",
                  "title": null
                }
              }
            ],
            "text": "Make Your Dream Trip a Reality"
          },
          {
            "type": "text",
            "text": " online course."
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "This course has been incredibly interesting to me! I've been curious about the world of miles and points for a long time, and I feel like I'm being given all the answers I need by listening to the videos in this course. It teaches you so many different ways to collect points and miles to travel all over the world for free and even how to upgrade that experience. The two instructors, Stephanie and Chris, have so many interesting travel stories which makes it really fun to watch. I cannot recommend this course highly enough if you are at all interested in the world of free travel. It's fascinating how easy it really can be to book that dream trip."
          }
        ]
      },
      {
        "type": "heading",
        "attrs": {
          "level": 3
        },
        "content": [
          {
            "type": "text",
            "text": "Get back into a workout routine."
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "This used to be a goal I listed in every goals post, but then I actually did start getting into a great work out routine and didn't need to post it every month. Well, times have changed. I basically don't go to the gym ever these days. I'm pretty sure it has been two or three months since I went to my last class at the gym. I definitely feel slow, and I lack the energy and motivation that I used to get from my morning work outs. Hopefully I can get back into the habit."
          }
        ]
      },
      {
        "type": "heading",
        "attrs": {
          "level": 3
        },
        "content": [
          {
            "type": "text",
            "text": "Get plugged back in to the blogging community."
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "Last fall I started participating in more link-ups and getting involved in the Peony Project Facebook group. I'm ready to jump back into both and be diligent about commenting on other blogs and participating in this wonderful blogging community. This is the exact same goal that I posted in my last goals post in February right before I disappeared from the blogging world. Needless to say, I failed at this goal that time, so I'm ready to try again!"
          }
        ]
      },
      {
        "type": "heading",
        "attrs": {
          "level": 3
        },
        "content": [
          {
            "type": "text",
            "text": "Get set up on my new Macbook Air."
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "This is another repeat goal from February. It's actually my husband's old laptop, but his work purchased him a new one earlier this year, so I get the old one! So, after over a year of blogging almost completely on my iPad and on my work computer (which blocks a lot of programs and other things I want to do with the blog), I'm going to have my own computer! I'm so excited to have a place to store photos and edit them and do all kinds of things for the blog! I've never used a Mac before, so there will be a learning curve (especially because I use a PC for work), but I'm looking forward to the challenge."
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "I hope you have a great weekend!"
          }
        ]
      }
    ]
  }
}