{
  "data": {
    "title": "Weekly Wishes #25",
    "date": "2014-07-16",
    "categories": [
      "weekly-wishes"
    ],
    "tags": [
      "blog-design",
      "books",
      "goals-2",
      "organizing"
    ],
    "coverImage": "https://www.everydayaccountsblog.com/wp-content/uploads/2014/07/20140720-215719-79039096.jpg",
    "id": "2347",
    "slug": "weekly-wishes-25",
    "excerpt": "Each week, I link up with The Nectar Collective to join the community of bloggers who share their goals for the week. I'm continuing to update my goals for the entire month of July rather than having a new set of goals each week. Right now, thinking about my to-dos in this big picture format has been working the best for me. Sometimes I wonder why I post these goals updates, but then I remember how much I am motivated by reading other people's goals, and I also think about the encouragement I have gotten from doing this link-up. For these reasons, I definitely want to continue doing these posts, at least for the time being. I don't expect that most people would like reading goals updates, but that's okay! <br/>"
  },
  "content": {
    "type": "doc",
    "content": [
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "[caption id=\"\" align=\"alignnone\" width=\"618\"]"
          },
          {
            "type": "image",
            "attrs": {
              "src": "images/20140715-204629-74789644.jpg",
              "alt": "20140715-204629-74789644.jpg",
              "title": null
            }
          },
          {
            "type": "text",
            "text": " Driving along the Galveston coast[/caption]"
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "Each week, I link up with "
          },
          {
            "type": "text",
            "marks": [
              {
                "type": "link",
                "attrs": {
                  "href": "http://www.thenectarcollective.com/2014/07/weekly-wishes-60/",
                  "title": null
                }
              }
            ],
            "text": "The Nectar Collective"
          },
          {
            "type": "text",
            "text": " to join the community of bloggers who share their goals for the week. I'm continuing to update my goals for the entire month of July rather than having a new set of goals each week. Right now, thinking about my to-dos in this big picture format has been working the best for me."
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "Sometimes I wonder why I post these goals updates, but then I remember how much I am motivated by reading other people's goals, and I also think about the encouragement I have gotten from doing this link-up. For these reasons, I definitely want to continue doing these posts, at least for the time being. I don't expect that most people would like reading goals updates, but that's okay!"
          }
        ]
      },
      {
        "type": "heading",
        "attrs": {
          "level": 2
        },
        "content": [
          {
            "type": "text",
            "text": "July Goals"
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "1. "
          },
          {
            "type": "text",
            "marks": [
              {
                "type": "strong"
              }
            ],
            "text": "Read three books."
          },
          {
            "type": "text",
            "text": " I should be wrapping up book #2 soon! It has been great to be back into a good habit of reading."
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "2. "
          },
          {
            "type": "text",
            "marks": [
              {
                "type": "strong"
              }
            ],
            "text": "Organize my jewelry."
          },
          {
            "type": "text",
            "text": " Over the weekend, I was randomly walking past The Container Store, so I dropped in to take another look at the jewelry organization sets I have been eyeing for months. Well, they happened to be on sale, so I took that as a sign that I should buy them. I had some good ideas on cheaper alternatives, but none of them were working for me due to my small drawer space and various other reasons. I'm happy with the purchase, and I look forward to diving in and being reunited with all the jewelry I have forgotten about over the years."
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "3. "
          },
          {
            "type": "text",
            "marks": [
              {
                "type": "strong"
              }
            ],
            "text": "Revamp my blog design and layout!!"
          },
          {
            "type": "text",
            "text": " I am happy to report that I have a fun, new blog design and layout nearly ready to go! Daniel helped me out over the weekend - I could not have done this without him. We had hoped to launch it Sunday night, but there are a few more things I want to tweak before I completely transition over. I imagine it will be up by one week from now, and I can't wait!"
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "4. "
          },
          {
            "type": "text",
            "marks": [
              {
                "type": "strong"
              }
            ],
            "text": "Write all of my posts about our Europe trip that I have planned... and post them!"
          },
          {
            "type": "text",
            "text": " I am not making good progress on this goal. I may have to give myself some extra time to actually write all of the remaining posts, but I plan to have the next one up soon (hopefully this week)."
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "5. "
          },
          {
            "type": "text",
            "marks": [
              {
                "type": "strong"
              }
            ],
            "text": "Explore "
          },
          {
            "type": "text",
            "marks": [
              {
                "type": "strong"
              },
              {
                "type": "link",
                "attrs": {
                  "href": "http://www.skillshare.com",
                  "title": null
                }
              }
            ],
            "text": "SkillShare"
          },
          {
            "type": "text",
            "marks": [
              {
                "type": "strong"
              }
            ],
            "text": " classes and start working on one."
          },
          {
            "type": "text",
            "text": " From last week: \"I want to be a life-long learner. To me this involves reading fiction and non-fiction, traveling, working on a language with my Duolingo app, watching documentaries, working on playing an instrument (for me, this would be piano, but I haven't played in years), keeping up with current events, and taking classes just for the sake of learning. I've done a decent job of being a life-long learner in some of these areas, but I want to work on the areas I'm neglecting. Hopefully, signing up for SkillShare will help me to grow and work my brain! Do you have any class recommendations? I'm interested in so many different things, but I imagine I would want my first class to be related to developing my blog since that is currently my main hobby.\" I have looked into and started a couple of classes, but I haven't committed to one just yet!"
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "I'm happy with my goal progress as of this week. Hopefully, I can keep it up! In other news, I think I am getting sick, so I'm going to bed as soon as I publish this. Goodnight, world!"
          }
        ]
      }
    ]
  }
}