{
  "data": {
    "title": "June Favorites",
    "date": "2014-07-11",
    "categories": [
      "monthly-favorites"
    ],
    "tags": [
      "beauty",
      "blogs",
      "books",
      "dessert",
      "june",
      "onerepublic",
      "starbucks"
    ],
    "id": "2315",
    "slug": "june-favorites"
  },
  "content": {
    "type": "doc",
    "content": [
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "June is over. Actually, we are almost halfway through July! I'm going to join the rest of the world (again) by saying that I am in shock how quickly 2014 is going. Life, won't you slow down already?"
          }
        ]
      },
      {
        "type": "heading",
        "attrs": {
          "level": 2
        },
        "content": [
          {
            "type": "text",
            "text": "Book"
          }
        ]
      },
      {
        "type": "heading",
        "attrs": {
          "level": 3
        },
        "content": [
          {
            "type": "text",
            "marks": [
              {
                "type": "link",
                "attrs": {
                  "href": "http://www.amazon.com/Memory-Keepers-Daughter-Novel/dp/0143037145",
                  "title": null
                }
              }
            ],
            "text": "The Memory Keeper's Daughter"
          },
          {
            "type": "text",
            "text": " by Kim Edwards"
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "I was able to read three books in June. My favorite of the three was The Memory Keeper's Daughter. This book surprised me - I didn't expect to love it. The reviews were not above average, and the plot sounded interesting but not fantastic. I honestly just picked it out because it was the first book that came to mind to qualify for one of the categories in the "
          },
          {
            "type": "text",
            "marks": [
              {
                "type": "link",
                "attrs": {
                  "href": "http://www.everydayaccountsblog.com/2014/05/01/semi-charmed-summer-2014-book-challenge/",
                  "title": "Semi-Charmed Summer 2014 Book Challenge"
                }
              }
            ],
            "text": "summer reading challenge"
          },
          {
            "type": "text",
            "text": " I'm doing. But I loved it! Edwards has a beautiful writing style. I found myself absorbed in the story and reading hundreds of pages at a time without putting it down. While the ending wasn't what I was hoping for, it does wrap up nicely. I highly recommend you add this to your summer reading list."
          }
        ]
      },
      {
        "type": "heading",
        "attrs": {
          "level": 2
        },
        "content": [
          {
            "type": "text",
            "text": "Music"
          }
        ]
      },
      {
        "type": "heading",
        "attrs": {
          "level": 3
        },
        "content": [
          {
            "type": "text",
            "text": "OneRepublic"
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "Yes, I know OneRepublic has been popular for years. But before this summer, I never really liked many of their songs I heard on the radio. Then my co-workers invited me to join them at the OneRepublic concert, and that changed it all for me! I can't stop listening to their newest album Native. I love the song \"I Lived\" - Ryan Tedder (lead singer of the band) wrote this song for his four-year-old son; it's all about living life to the fullest, and I find it very inspiring."
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "image",
            "attrs": {
              "src": "images/20140711-160749-58069952.jpg",
              "alt": "20140711-160749-58069952.jpg",
              "title": null
            }
          }
        ]
      },
      {
        "type": "heading",
        "attrs": {
          "level": 2
        },
        "content": [
          {
            "type": "text",
            "text": "Food"
          }
        ]
      },
      {
        "type": "heading",
        "attrs": {
          "level": 3
        },
        "content": [
          {
            "type": "text",
            "marks": [
              {
                "type": "link",
                "attrs": {
                  "href": "https://www.skinnycow.com/products/detail.aspx?id=44",
                  "title": null
                }
              }
            ],
            "text": "Skinny Cow Snickerdoodle Cookies"
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "I don't have a picture of these because I made myself stop buying them to prevent devouring them everyday, but click the link to take a look. Basically, a Snickerdoodle Skinny Cow is an ice cream sandwich with cinnamon ice cream between two oatmeal cookies. And somehow, this magical little dessert is only 140 calories! It's pretty fantastic - especially for summertime!"
          }
        ]
      },
      {
        "type": "heading",
        "attrs": {
          "level": 2
        },
        "content": [
          {
            "type": "text",
            "text": "Beauty/Skincare"
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "image",
            "attrs": {
              "src": "images/20140711-192427-69867907.jpg",
              "alt": "20140711-192427-69867907.jpg",
              "title": null
            }
          }
        ]
      },
      {
        "type": "heading",
        "attrs": {
          "level": 3
        },
        "content": [
          {
            "type": "text",
            "text": "Stila In The Light Eyeshadow Palette"
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "For my birthday, I received some spending money from family members. Thanks to their generosity, I was able to buy this palette and the Lush Ocean Salt Scrub (see below). I had been eyeing this palette for a while, and I'm so glad I got it! I wore it throughout all of June, and I think I'll be constantly wearing it year-round. I'll admit, I've only really used the lighter colors, but I'm hoping to become a little more adventurous by trying out some looks with the darker colors for special occasions soon."
          }
        ]
      },
      {
        "type": "heading",
        "attrs": {
          "level": 3
        },
        "content": [
          {
            "type": "text",
            "text": "Lush Ocean Salt Face & Body Scrub"
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "I had heard so many great things about this scrub before buying it. Now that I have it, I wish I could continually repurchase it! It smells AMAZING - lime and coconut and vanilla and all the best summer scents in one. The lady in the store told me it was \"like a margarita for your body\", and she was right! The sea salt provides a really good scrub for your face and your body. My skin feels so soft after using it. My only complaint is that you have to use a lot of product to scrub your whole body since the sea salt dissolves so quickly. This means if you use it regularly, it won't last long. I have been using it about twice a week for one month, and my 8.8oz container is nearly empty. I don't think I will repurchase for now because of the price - $36! While I definitely loved using it this month, I just can't justify paying that much for a product that only lasts a month or two. I do plan to treat myself to it occasionally in the future though!"
          }
        ]
      },
      {
        "type": "heading",
        "attrs": {
          "level": 2
        },
        "content": [
          {
            "type": "text",
            "text": "Tech"
          }
        ]
      },
      {
        "type": "heading",
        "attrs": {
          "level": 3
        },
        "content": [
          {
            "type": "text",
            "text": "Starbucks App"
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "I have been using the Starbucks app for a while. I love how easy the app is to use. You just open it up, shake your phone, and the bar code pops up. Every Starbucks I have ever been too will now accept payment with this app. At first, I was worried that the automatic re-fill feature would encourage me to buy too much Starbucks, but I have figured out the perfect system to make it work in my favor. Since I'm a Starbucks gold member, I get every 12th drink free. Since I love their Blonde Roast regular coffee, I almost always order that so that I'm not spending $4-6 every time I go. Even though this is a much cheaper purchase than most of their drinks, it still counts as one of the twelve stars toward a free drink on my app. With my husband and I sharing the same account, we get free drinks fairly often, so it's fun to treat ourselves to some of the more exciting cappuccinos, frappuccinos, and lattes with those free drinks that we earn."
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "image",
            "attrs": {
              "src": "images/20140711-160750-58070063.jpg",
              "alt": "20140711-160750-58070063.jpg",
              "title": null
            }
          }
        ]
      },
      {
        "type": "heading",
        "attrs": {
          "level": 2
        },
        "content": [
          {
            "type": "text",
            "text": "Blog"
          }
        ]
      },
      {
        "type": "heading",
        "attrs": {
          "level": 3
        },
        "content": [
          {
            "type": "text",
            "marks": [
              {
                "type": "link",
                "attrs": {
                  "href": "http://www.siddathornton.blogspot.com/",
                  "title": null
                }
              }
            ],
            "text": "Siddathornton"
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "I've been a fan of Lauren's blog for a while now. She took somewhat of a break from blogging for a bit, but then she recently came back in full force by blogging every single day in June. Now she has released her new posting schedule, and I'm excited to see that she plans to continue blogging regularly! She has a gift for making the simple things in life seem magical. I also think that she and I have very similar interests which naturally makes me more interested in what she has to say. I've been linking up with her all year with The Sunday Currently link-up that she hosts, and I have found many of my other favorite bloggers through the link-up. You should definitely hop on over and click through some of her posts "
          },
          {
            "type": "text",
            "marks": [
              {
                "type": "link",
                "attrs": {
                  "href": "http://www.siddathornton.blogspot.com/",
                  "title": null
                }
              }
            ],
            "text": "here"
          },
          {
            "type": "text",
            "text": "!"
          }
        ]
      },
      {
        "type": "heading",
        "attrs": {
          "level": 3
        },
        "content": [
          {
            "type": "text",
            "text": "What did you enjoy in June?"
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "Click "
          },
          {
            "type": "text",
            "marks": [
              {
                "type": "link",
                "attrs": {
                  "href": "http://www.everydayaccountsblog.com/category/monthly-favorites/",
                  "title": null
                }
              }
            ],
            "text": "here"
          },
          {
            "type": "text",
            "text": " to see all of my past favorites posts!"
          }
        ]
      }
    ]
  }
}