{
  "data": {
    "title": "8 Steps to Planning the Perfect Itinerary | Travel Prep Series",
    "date": "2016-08-25",
    "categories": [
      "travel-prep-series"
    ],
    "tags": [
      "adventure",
      "itinerary",
      "planning",
      "travel-prep"
    ],
    "coverImage": "https://www.everydayaccountsblog.com/wp-content/uploads/2016/08/Travel-Prep-Series_Planning-the-Perfect-Itinerary-2.jpg",
    "id": "7387",
    "slug": "8-steps-to-planning-the-perfect-itinerary-travel-prep-series"
  },
  "content": {
    "type": "doc",
    "content": [
      {
        "type": "paragraph",
        "content": [
          {
            "type": "image",
            "attrs": {
              "src": "images/Travel-Prep-Series_Planning-the-Perfect-Itinerary-2.jpg",
              "alt": "Travel Prep Series_Planning the Perfect Itinerary",
              "title": null
            },
            "marks": [
              {
                "type": "link",
                "attrs": {
                  "href": "http://www.everydayaccountsblog.com/wp-content/uploads/2016/08/Travel-Prep-Series_Planning-the-Perfect-Itinerary-2.jpg",
                  "title": null
                }
              }
            ]
          },
          {
            "type": "text",
            "text": " Welcome to the fourth part of my Travel Prep Series! As mentioned in "
          },
          {
            "type": "text",
            "marks": [
              {
                "type": "link",
                "attrs": {
                  "href": "http://www.everydayaccountsblog.com/category/travel-prep-series/",
                  "title": null
                }
              }
            ],
            "text": "my previous travel prep posts"
          },
          {
            "type": "text",
            "text": ", after traveling often over the past few years, I feel like I now have a solid strategy in place for planning a trip, and I'm excited to share that with you! None of these tips are life-changing. They are just the simple steps I take to prepare for a trip before our departure date. So far, using these steps, we have managed to see many parts of the world on the many (mostly) seamless trips we have taken over the past five years."
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "The fourth part of my travel prep process is my favorite - planning the itinerary! Going through these steps, I'm able to plan out the time at our chosen destination so that we can make the most of it and tailor it to our own interests. I should note that I really love the planning aspect of travel, and I'm aware that this doesn't suit everyone's travel style. I'm also of the opinion that you need to leave time open to wander and explore, so I don't book up all day every day with plans.  However, if you prefer to travel with no plan at all, this process is not for you as you probably aren't interested in making a plan (and probably wouldn't have clicked this link in the first place!). Here are my steps to a perfect travel itinerary!"
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "marks": [
              {
                "type": "em"
              }
            ],
            "text": "(I link to several tools in this post; however, this is just for your convenience. I do not get compensated in any way by these companies.)"
          }
        ]
      },
      {
        "type": "heading",
        "attrs": {
          "level": 2
        },
        "content": [
          {
            "type": "text",
            "text": "1. Create a document to plan out your itinerary."
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "Daniel and I use Google Docs because it has a simple interface and is easy for us to both edit from our separate computers. For examples of itineraries in Google Docs for actual trips we have taken, click "
          },
          {
            "type": "text",
            "marks": [
              {
                "type": "link",
                "attrs": {
                  "href": "https://docs.google.com/document/d/1gIUlhMwBDkm7KHuAISrPlPgJoJDimXYo63aSQIaH03s/edit?usp=sharing",
                  "title": null
                }
              }
            ],
            "text": "here"
          },
          {
            "type": "text",
            "text": " for a short domestic trip and "
          },
          {
            "type": "text",
            "marks": [
              {
                "type": "link",
                "attrs": {
                  "href": "https://docs.google.com/document/d/1_Qes7G77QAkocggAoLUv8Q7X9ICijbkFFWpJ3WQdKic/edit?usp=sharing",
                  "title": null
                }
              }
            ],
            "text": "here"
          },
          {
            "type": "text",
            "text": " for a longer international trip. I don't worry about making them too pretty and edited. They are just a functional way for me to map out our trips and make sure we don't miss anything we really want to do. Microsoft Word, Excel, or even pen and paper would work just fine for this purpose as well."
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "To set up your itinerary document, go ahead and give it a heading and put in your dates, flight information, and lodging information. We like to put a grid at the top to keep a running list of sites/activities and restaurants, and we sometimes break this grid down into \"must dos\" and \"maybe dos\" (see "
          },
          {
            "type": "text",
            "marks": [
              {
                "type": "link",
                "attrs": {
                  "href": "https://docs.google.com/document/d/1_Qes7G77QAkocggAoLUv8Q7X9ICijbkFFWpJ3WQdKic/edit?usp=sharing",
                  "title": null
                }
              }
            ],
            "text": "this international itinerary example"
          },
          {
            "type": "text",
            "text": " for what I mean)."
          }
        ]
      },
      {
        "type": "heading",
        "attrs": {
          "level": 2
        },
        "content": [
          {
            "type": "text",
            "text": "2. Create a Google map."
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "A map will help you visualize your itinerary and group your activities in the same areas on the same days. We don't always do this, but I think it makes trip planning simpler and more fun.  Here is an example I made for our NYC trip in December 2014:"
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "<iframe src=\"https://www.google.com/maps/d/u/0/embed?mid=1b0uFONxidLPk8UeR-NO4glo8rzA\" width=\"640\" height=\"480\"></iframe>"
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "Start by pinning your hotel or Airbnb - I like to use the house icon for this. You can see our house icon for our Airbnb on the Upper West Side by Central Park.  You might pin the airport or a main train station you will be using, but then move on to the next step."
          }
        ]
      },
      {
        "type": "heading",
        "attrs": {
          "level": 2
        },
        "content": [
          {
            "type": "text",
            "text": "3. Search Pinterest  and Google for suggested itineraries, things to do, and recommended restaurants."
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "In my opinion, blogs offer the best itineraries and travel recommendations, and Pinterest is the best way to search for those blog posts. Putting in search terms as simple as \"one week in LA itinerary\" or \"weekend in Washington D.C.\" will bring up tons of great resources for you to click through and pin to your adventure board (see one of mine "
          },
          {
            "type": "text",
            "marks": [
              {
                "type": "link",
                "attrs": {
                  "href": "https://www.pinterest.com/e_abernathy/usa-adventure-inspiration/",
                  "title": null
                }
              }
            ],
            "text": "here"
          },
          {
            "type": "text",
            "text": "!). As you see ideas you like, start adding them to your grid that you created in your itinerary document in step 1."
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "Google is a good resource too. I typically like to put the word \"blog\" at the end of my search terms (e.g. \"one week in London itinerary blog\") since I prefer to read a blogger's itinerary over an impersonal one from a major travel company.  I should note - Rick Steves is an exception for me. I find his content personal, helpful, and enjoyable to read, so I always make sure to look at his suggestions for European destinations when they pop up in my Google searches."
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "While jotting down your favorite options, think beyond just the famous attractions and museums. Pay attention to recommended walking tours, parks, neighborhoods, and other places you might not normally think to explore."
          }
        ]
      },
      {
        "type": "heading",
        "attrs": {
          "level": 2
        },
        "content": [
          {
            "type": "text",
            "text": "4. Consult "
          },
          {
            "type": "text",
            "marks": [
              {
                "type": "link",
                "attrs": {
                  "href": "http://www.tripadvisor.com",
                  "title": null
                }
              }
            ],
            "text": "TripAdvisor's"
          },
          {
            "type": "text",
            "text": " Top \"Things to Do\"."
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "When you open "
          },
          {
            "type": "text",
            "marks": [
              {
                "type": "link",
                "attrs": {
                  "href": "http://www.tripadvisor.com",
                  "title": null
                }
              }
            ],
            "text": "TripAdvisor"
          },
          {
            "type": "text",
            "text": ", type in your destination in the \"near\" section of the search bar. A drop down menu will appear in the \"find\" section of the search bar. Select \"things to do\". At this point you can scroll through the top ten or so (or more!) things to do at your destination based on ratings and reviews written by other travelers. As an example, click "
          },
          {
            "type": "text",
            "marks": [
              {
                "type": "link",
                "attrs": {
                  "href": "https://www.tripadvisor.com/Attractions-g187791-Activities-Rome_Lazio.html",
                  "title": null
                }
              }
            ],
            "text": "here"
          },
          {
            "type": "text",
            "text": " for a link to TripAdvisor's top thirty \"things to do\" in Rome."
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "As mentioned in Step 3, continue looking for the more unknown activity options such as walking tours, parks, neighborhoods, etc. We have booked a lot of great walking tours based on TripAdvisor recommendations!"
          }
        ]
      },
      {
        "type": "heading",
        "attrs": {
          "level": 2
        },
        "content": [
          {
            "type": "text",
            "text": "5. Do you love to try new restaurants while traveling?"
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "If the answer is no, then you probably want to skip this step, but if it's yes, stick around! One of my favorite parts of trip planning is looking through recommended restaurants and planning out a couple places to eat to make sure we get a good sample of the food that a destination has to offer. We often joke that we travel to eat (and I don't think we are 100% truly joking)! I gather these recommendations through a combination of TripAdvisor, Google searches, and recommendations from friends. Don't forget dessert places!"
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "Just as you did with activities, jot down your favorite options in the grid in your itinerary document."
          }
        ]
      },
      {
        "type": "heading",
        "attrs": {
          "level": 2
        },
        "content": [
          {
            "type": "text",
            "text": "6. Ask your friends for recommendations."
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "An easy way to do this is with a status update on Facebook sharing where you are going and asking for recommendations. In our experience, friends are more than happy to share quick tips through the comments. Asking friends for recommendations in person or on the phone works great as well!"
          }
        ]
      },
      {
        "type": "heading",
        "attrs": {
          "level": 2
        },
        "content": [
          {
            "type": "text",
            "text": "7. Personalize the itinerary."
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "Think out-of-the-box. What are your favorite things that you may not find on a list of \"must dos\" for a particular place? For us, we always look up local coffee shops, bookstores or libraries, and parks."
          }
        ]
      },
      {
        "type": "heading",
        "attrs": {
          "level": 2
        },
        "content": [
          {
            "type": "text",
            "text": "8. Add your \"must-do\" activities to your Google map and start planning out your vacation days!"
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "Once you pin the activities you want to do, places you want to see, and restaurants you want to visit, you will be able to better plan out your days. For example, using my New York City map above, I was able to see that we should ideally split our three-day weekend into Brooklyn, Lower Manhattan/ East Village, and Midtown based on what we really wanted to do, so that's what we did. You can then go in and pin the \"maybe dos\" that make sense based on your schedule and map so far."
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "At this point, you can start filling in your itinerary with a plan, making it as specific or as open as you want. I also recommend making restaurant reservations ahead of time for popular restaurants and booking any tours you'd like to do ahead of time."
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "image",
            "attrs": {
              "src": "images/IMG_6364-1024x768.jpg",
              "alt": "Austin Skyline",
              "title": null
            }
          },
          {
            "type": "text",
            "text": "You can spend as long or as little as you'd like on this, but don't fill up all of your time. Leave room to make some spontaneous decisions, to spend more time in an area you love, or to just get lost while exploring!"
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "That's my process for planning our trip itineraries, and both my husband and I agree that this process has created some amazing trips!"
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "Do you have any favorite trip planning tools, tips, or tricks? Share below in the comments!"
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "To see the other posts in my Travel Prep Series, click "
          },
          {
            "type": "text",
            "marks": [
              {
                "type": "link",
                "attrs": {
                  "href": "http://www.everydayaccountsblog.com/category/travel-prep-series/",
                  "title": null
                }
              }
            ],
            "text": "here"
          },
          {
            "type": "text",
            "text": "!"
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "marks": [
              {
                "type": "em"
              }
            ],
            "text": "{Thanks for reading! Want to know a little more about me? I'm a CPA learning how to balance a career with frequent travel while planting roots at home in Austin, TX. When I’m not exploring my home city with my husband Daniel or cuddling with our chubby orange cat Banana, I’m probably planning, packing, traveling to, or daydreaming about our next adventure. After all, my"
          },
          {
            "type": "text",
            "text": " "
          },
          {
            "type": "text",
            "marks": [
              {
                "type": "em"
              },
              {
                "type": "link",
                "attrs": {
                  "href": "http://www.everydayaccountsblog.com/2016/04/my-travel-mug-collection-updated/",
                  "title": null
                }
              }
            ],
            "text": "travel mug collection"
          },
          {
            "type": "text",
            "text": " "
          },
          {
            "type": "text",
            "marks": [
              {
                "type": "em"
              }
            ],
            "text": "is never complete. If you have wanderlust too, be sure to follow me on"
          },
          {
            "type": "text",
            "text": " "
          },
          {
            "type": "text",
            "marks": [
              {
                "type": "em"
              },
              {
                "type": "link",
                "attrs": {
                  "href": "https://www.instagram.com/emily_abernathy/",
                  "title": null
                }
              }
            ],
            "text": "Instagram"
          },
          {
            "type": "text",
            "marks": [
              {
                "type": "em"
              }
            ],
            "text": ","
          },
          {
            "type": "text",
            "text": " "
          },
          {
            "type": "text",
            "marks": [
              {
                "type": "em"
              },
              {
                "type": "link",
                "attrs": {
                  "href": "https://www.pinterest.com/e_abernathy/",
                  "title": null
                }
              }
            ],
            "text": "Pinterest"
          },
          {
            "type": "text",
            "marks": [
              {
                "type": "em"
              }
            ],
            "text": ","
          },
          {
            "type": "text",
            "text": " "
          },
          {
            "type": "text",
            "marks": [
              {
                "type": "em"
              },
              {
                "type": "link",
                "attrs": {
                  "href": "https://snapchat.com/add/emilya89",
                  "title": null
                }
              }
            ],
            "text": "Snapchat"
          },
          {
            "type": "text",
            "text": " "
          },
          {
            "type": "text",
            "marks": [
              {
                "type": "em"
              }
            ],
            "text": "(emilya89), or"
          },
          {
            "type": "text",
            "text": " "
          },
          {
            "type": "text",
            "marks": [
              {
                "type": "em"
              },
              {
                "type": "link",
                "attrs": {
                  "href": "http://bloglovin.com/everydayaccounts",
                  "title": null
                }
              }
            ],
            "text": "subscribe to my blog"
          },
          {
            "type": "text",
            "marks": [
              {
                "type": "em"
              }
            ],
            "text": "!__}"
          }
        ]
      },
      {
        "type": "heading",
        "attrs": {
          "level": 2
        },
        "content": [
          {
            "type": "text",
            "text": "Like it? Pin it!"
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "image",
            "attrs": {
              "src": "images/Travel-Prep-Series_Planning-the-Perfect-Itinerary_Pinterest-683x1024.jpg",
              "alt": "Travel Prep Series_Planning the Perfect Itinerary_Pinterest",
              "title": null
            },
            "marks": [
              {
                "type": "link",
                "attrs": {
                  "href": "http://www.everydayaccountsblog.com/wp-content/uploads/2016/08/Travel-Prep-Series_Planning-the-Perfect-Itinerary_Pinterest.jpg",
                  "title": null
                }
              }
            ]
          }
        ]
      }
    ]
  }
}