{
  "data": {
    "title": "My Blogging Challenge",
    "date": "2013-11-09",
    "categories": [
      "goals"
    ],
    "tags": [
      "writing"
    ],
    "id": "2344",
    "slug": "my-blogging-challenge"
  },
  "content": {
    "type": "doc",
    "content": [
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "I have thought about committing to a blog for a long time. I have hesitated for so long because I feel I don’t have enough to share that will interest a group of readers and keep them coming back for more. I’ve tried to think of a theme or specific topic for my blog, but I’ve never been able to come up with something that I find unique or intriguing. For over two years, I have waited for that fantastic idea to pop into my head that would make my blog stand out from the thousands of lifestyle blogs out there."
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "Well, that fantastic idea has still not magically made its way into my head and onto my computer. BUT I’m tired of waiting. I’m ready to write my thoughts and share them with whoever finds their way to this little space. I'm ready to tell my story to those who want to listen -- I believe writing will help me to embrace my own story and live this beautiful life to its fullest."
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "Once I start writing, maybe my blog will start shaping itself into its own unique place on the internet, or maybe it won’t.  Regardless, I’m excited to write and contribute and meet others in this huge world of internet blogging."
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "Over the past couple of weeks, I have developed a deep interest in discovering a way to use my skills that will eventually allow me to be location-independent while doing work that I love and living each day intentionally fulfilling my passions. This interest was fueled by the thoughts of author Chris Guillebeau in his book The Art of Non-Conformity and his related blog. Chris lives a life full of travel, writing, flexibility, hard work, and helping others. I want to take his thoughts as well as the thoughts of several other people with similar philosophies on work and lifestyle and begin to slowly incorporate these ideas into my life. After researching these types of ideas and studying the stories of people who have been able to set up these types of lives for themselves, I’ve decided that my first major step is to become committed to a blog. Once I start writing, I hope to discover how my unique passions and skills merge so that I can use them for meaningful work and to help others."
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "Here is the blogging challenge I am creating for myself.  Throughout the months of November and December, I will write three blog posts per week and will learn about the world of blogging and the mechanics that go along with it. I will try to post two of the three posts I write within a week of them being written, but I will not begin posting my third post per week until January 2014. Guillebeau suggests in a post on his blog that when a person considers starting a blog, it is a good idea to have three months of content ready to go before ever clicking that “Publish” button. While I will not be following this plan specifically, I believe this will be a great start for me and will fuel my creativity. Once I begin publishing my other content in January, I will still attempt to write posts twice a week, saving some for later and publishing some as I write. My busy season at work starts in February, so I imagine I will be using quite a bit of my stored blogging content during the months of February, March, and April."
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "text": "So, there you have it. That is my commitment for now. Hopefully, I’ll have other goals (blog-related and life-related) that I’ll be working toward as we approach the New Year. I’m really looking forward to this journey!"
          }
        ]
      },
      {
        "type": "paragraph",
        "content": [
          {
            "type": "text",
            "marks": [
              {
                "type": "link",
                "attrs": {
                  "href": "http://www.bloglovin.com/blog/11274985/?claim=yu9aavmncd9",
                  "title": null
                }
              }
            ],
            "text": "Follow my blog with Bloglovin"
          }
        ]
      }
    ]
  }
}